app/models/user.rb

  def self.create_from_provider_data(auth)
    where(provider: auth.provider, uid: auth.uid).first_or_create do |user|
---
INSERT INTO "users" ("encrypted_password", "confirmed_at", "created_at", "updated_at", "name", "provider", "uid") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT "users".* FROM "users" WHERE "users"."provider" = ? AND "users"."uid" = ? ORDER BY "users"."id" ASC LIMIT ?  [["provider", "twitter"], ["uid", "733352694216265730"], ["LIMIT", 1]]